# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# Пример:
# - 6782 -> 23
# - 0,56 -> 11

def func(num):
    count = 0
    for i in num:
        if i.isdigit():
            count += int(i)
    return count


num = input("Введите вещественное число : ")
print(f"Сумма цифр введенного числа = {func(num)}")
