# Задайте список из n чисел, заполненный по формуле
# (1 + 1/n) ** n и выведите на экран их сумму.
# Задача на сайте ГБ с ошибками. Решала задачу, условие которое откорректированно Николаем Мануиловым.
def calc(n):
    list = []
    sum = 0
    for i in range(n):
        list.append((1 + 1 / (i + 1)) ** (i + 1))
        sum += list[i]
        i += 1
    print(list)
    return sum


n = input('Введите число n: ')
print(calc(int(n)))
