# 4.Напишите программу, которая по заданному номеру четверти, 
# показывает диапазон возможных координат точек в этой четверти (x и y).

number = int(input('Введите номер координатной четверти:'))
if number == 1:
    print('Диапазоны для возможных координат в первой координатной четверти x > 0, у > 0')

elif number == 2:
    print('Диапазоны для возможных координат во второй координатной четверти x < 0, у > 0')

elif number == 3:
    print('Диапазоны для возможных координат в третьей координатной четверти x < 0, у < 0')

elif number == 4:
    print('Диапазоны для возможных координат в четвертой координатной четверти x > 0, у < 0')

else:
    print('Введенное число не является номером координатной четверти')