# 1. Напишите программу, которая принимает на вход цифру,
# обозначающую день недели, и проверяет, является ли этот день выходным.
# - 6 -> да
# - 7 -> да
# - 1 -> нет

number = int(input('Введите цифру дня недели от 1 до 7: '))
if number == 6 or number == 7:
    print(f'Цифра дня недели {number} является выходным')
else:
    print(f'Цифра дня недели {number} является рабочим')